app/controllers/messages_controller.rb

  def index
    @messages = Message.all
---
SELECT * FROM "messages"

  def show
    @message = Message.find(params[:id])
---
SELECT * FROM "messages" WHERE ("messages"."id" = 1)

  def create
    @message = Message.new(params[:message])

    respond_to do |format|
      if @message.save
---
INSERT INTO "messages" ("created_at", "title", "updated_at", "ip", "context", "user") VALUES('2011-08-07 03:25:23', 'qw', '2011-08-07 03:25:23', NULL, '#更有趣的策略选出两个pk图片,现在是随机的#