app/controllers/picks_controller.rb

INSERT INTO "picks" ("created_at", "loss_pic_id", "updated_at", "ip", "user", "win_pic_id") VALUES('2011-07-17 06:15:09', 'l', '2011-07-17 06:15:09', '127.0.0.1', 'mySelf', 12)
---
  def pickView

    @win_pic_id = params[:l_pic_id];
    @lose_pic_id = params[:r_pic_id];

    @pick = Pick.new
    @pick.user = 'mySelf';
    @pick.ip = request.remote_ip;

    @pick.win_pic_id = @win_pic_id;
    @pick.loss_pic_id = @lose_pic_id;

    #puts @win_pic_id
    #puts @lose_pic_id

   #winPic = Pic.new(@win_pic_id);
   pp = Pic.new;
   pp.pk(@win_pic_id, @lose_pic_id);
   #winPic.pk(@lose_pic_id);

   puts @win_pic_id

   respond_to do |format|
     if @pick.save

SELECT * FROM "pics" WHERE (id <> :l_id) ORDER BY RANDOM() LIMIT 1
SELECT * FROM "pics" ORDER BY RANDOM() LIMIT 1
SELECT count(*) AS count_all FROM "pics" WHERE (wins > 0 and losses > 0)
---
  def new

    @l_pics = Pic.find(:all, :order => "RANDOM() LIMIT 1");
    l_id = @l_pics[0].id;
#    puts l_id
    @r_pics = Pic.find(:all, :conditions =>["id <> ?", l_id], :order => "RANDOM() LIMIT 1");
    #puts  @r_pic。size;
    #puts @pic_rnd.description

    @l_pic = @l_pics[0];
    @r_pic = @r_pics[0];

    #进度条获取
    @pickPercentage = Pic.count(:all, :conditions =>["wins > 0 or losses > 0"] );