app/controllers/pics_controller.rb

  def index
    #@pics = Pic.find(:all, :order => "scores desc")

    @pics = Pic.search(params[:page])
---
SELECT * FROM "pics" ORDER BY scores desc LIMIT 5 OFFSET 0
SELECT count(*) AS count_all FROM "pics"

  def show
    @pic = Pic.find(params[:id])
---
SELECT * FROM "pics" WHERE ("pics"."id" = '1')

  def create
    @pic = Pic.new(params[:pic])
    if @pic.scores == nil
      @pic.scores = 0
    end
    if @pic.wins == nil
      @pic.wins = 0
    end
    if @pic.losses == nil
      @pic.losses = 0
    end

    respond_to do |format|
      if @pic.save
---
INSERT INTO "pics" ("created_at", "title", "image_url", "updated_at", "scores", "wins", "description", "losses") VALUES('2011-07-17 13:15:40', '一', 'http://images.instagram.com/media/2011/05/10/5683bee199bf49dc8176dce7bdfcdc7d_6.jpg', '2011-07-17 13:15:40', NULL, NULL, '', NULL)

  def update
    @pic = Pic.find(params[:id])

    respond_to do |format|
      if @pic.update_attributes(params[:pic])
---
SELECT * FROM "pics" WHERE ("pics"."id" = 1)
UPDATE "pics" SET "image_url" = 'http://distillery.s3.amazonaws.com/media/2011/03/07/8c56ca8c896043bb9913b4c15196182d_6.jpg' WHERE "id" = 1

  def destroy
    @pic = Pic.find(params[:id])
    @pic.destroy
---
SELECT * FROM "pics" WHERE ("pics"."id" = 276)
DELETE FROM "pics" WHERE "id" = 276